wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32F146FX.h
/*******************************************************************************
* Copyright (C) 2017, Huada Semiconductor Co.,Ltd All rights reserved.
*
* This software is owned and published by:
* Huada Semiconductor Co.,Ltd ("HDSC").
*
* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
*
* This software contains source code for use with HDSC
* components. This software is licensed by HDSC to be adapted only
* for use in systems utilizing HDSC components. HDSC shall not be
* responsible for misuse or illegal use of this software for devices not
* supported herein. HDSC is providing this software "AS IS" and will
* not be responsible for issues arising from incorrect user implementation
* of the software.
*
* Disclaimer:
* HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
* REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),
* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
* WARRANTY OF NONINFRINGEMENT.
* HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
* SAVINGS OR PROFITS,
* EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
* FROM, THE SOFTWARE.
*
* This software may be replicated in part or whole for the licensed use,
* with the restriction that this Disclaimer and Copyright notice must be
* included with each copy of this software, whether used in part or whole,
* at all times.
*/
/******************************************************************************/
/** \\file HC32F146FX.h
**
** Auto generate.
** Headerfile for HC32F146FX series MCU
**
** History:
**
**   - 2017-10-11  0.1   First version for Device Driver Library of Module.
**
******************************************************************************/

#ifndef __HC32F146FX_H__
#define __HC32F146FX_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************
* Configuration of the Cortex-M0P Processor and Core Peripherals
******************************************************************************/
#define __MPU_PRESENT           0 /* No MPU                                       */
#define __NVIC_PRIO_BITS        2 /* M0P uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig  0 /* Set to 1 if different SysTick Config is used */

/******************************************************************************
* Interrupt Number Definition
******************************************************************************/
typedef enum IRQn
{
    NMI_IRQn            = -14, /*  2 Non Maskable                            */
    HardFault_IRQn      = -13, /*  3 Hard Fault                              */
    SVC_IRQn            = -5,  /* 11 SV Call                                 */
    PendSV_IRQn         = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn        = -1,  /* 15 System Tick                             */
    
    CSV_IRQn            = 0 ,
    SWWDT_IRQn          = 1 ,
    LVD_IRQn            = 2 ,
    EXINT0_7_IRQn       = 4 ,
    EXINT8_15_IRQn      = 5 ,
    DTIM_IRQn           = 6 ,
    MSC4RX_IRQn         = 15,
    MSC4TX_IRQn         = 16,
    MSC5RX_IRQn         = 17,
    MSC5TX_IRQn         = 18,
    MSC6RX_DMAC0_IRQn   = 19,
    MSC6TX_DMAC1_IRQn   = 20,
    OSC_CC_RP_IRQn      = 24,
    ADC0_IRQn           = 25,
    VC_IRQn             = 26,
    CTIM0_3_FLASH_IRQn  = 31,
    
    
} IRQn_Type;


#include <core_cm0plus.h>
#include <stdint.h>

#define SUCCESS         (0)
#define ERROR           (-1)

#ifndef NULL
#define NULL            (0)
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

typedef struct
{
    __IO uint16_t SCF                       : 1;
    __IO uint16_t PCF                       : 1;
    __IO uint16_t PCP                       : 1;
    uint16_t RESERVED3                      : 2;
    __IO uint16_t REFS                      : 1;
    __IO uint16_t ALGN                      : 1;
    __IO uint16_t SP                        : 1;
} stc_adc_adctl_field_t;

typedef struct
{
    __IO uint16_t ADINT0E                   : 1;
    __IO uint16_t ADINT1E                   : 1;
    __IO uint16_t ADINT2E                   : 1;
    __IO uint16_t ADINT3E                   : 1;
    __IO uint16_t ADINT0F                   : 1;
    __IO uint16_t ADINT1F                   : 1;
    uint16_t RESERVED6                      : 1;
    __IO uint16_t ADINT3F                   : 1;
    __IO uint16_t ADINT4E                   : 1;
    uint16_t RESERVED9                      : 3;
    __IO uint16_t ADINT4F                   : 1;
} stc_adc_adcint_field_t;

typedef struct
{
    __IO uint8_t SCST                       : 1;
    __IO uint8_t SCTMEN                     : 1;
    __IO uint8_t RPT                        : 1;
    __IO uint8_t SMOD                       : 1;
    __IO uint8_t SCCLR                      : 1;
    __IO uint8_t SOV                        : 1;
    __IO uint8_t SCFUL                      : 1;
    __IO uint8_t SCEMP                      : 1;
} stc_adc_adcsctl_field_t;

typedef struct
{
    __IO uint8_t SDPTH                      : 4;
} stc_adc_sfs_field_t;

typedef struct
{
    __IO uint32_t SCH                       : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t STRGM                     : 2;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SVLD                      : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t SFD                       :12;
} stc_adc_sfd_field_t;

typedef struct
{
    __IO uint32_t CHSL0                     : 1;
    __IO uint32_t CHSL1                     : 1;
    __IO uint32_t CHSL2                     : 1;
    __IO uint32_t CHSL3                     : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t CHSL8                     : 1;
    __IO uint32_t CHSL9                     : 1;
    __IO uint32_t CHSL10                    : 1;
    __IO uint32_t CHSL11                    : 1;
    __IO uint32_t CHSL12                    : 1;
    __IO uint32_t CHSL13                    : 1;
    __IO uint32_t CHSL14                    : 1;
    __IO uint32_t CHSL15                    : 1;
} stc_adc_adsin0_field_t;

typedef struct
{
    __IO uint32_t SCHSL0                    : 5;
    __IO uint32_t SCHSL1                    : 5;
    __IO uint32_t SCHSL2                    : 5;
    __IO uint32_t SCHSL3                    : 5;
    __IO uint32_t SCHSL4                    : 5;
    __IO uint32_t SCHSL5                    : 5;
} stc_adc_adsin1_field_t;

typedef struct
{
    __IO uint8_t PCST                       : 1;
    __IO uint8_t PCTMEN                     : 1;
    __IO uint8_t EXTEN                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PCCLR                      : 1;
    __IO uint8_t POV                        : 1;
    __IO uint8_t PCFUL                      : 1;
    __IO uint8_t PCEMP                      : 1;
} stc_adc_adcpctl_field_t;

typedef struct
{
    __IO uint8_t PDPTH                      : 2;
} stc_adc_pfs_field_t;

typedef struct
{
    __IO uint32_t PCH                       : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t PTRGM                     : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t PVLD                      : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t PFD                       :12;
} stc_adc_pfd_field_t;

typedef struct
{
    __IO uint16_t L1CH                      : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t L2CH                      : 5;
} stc_adc_adpin_field_t;

typedef struct
{
    __IO uint8_t CMPCH                      : 5;
    __IO uint8_t CMPMD0                     : 1;
    __IO uint8_t CMPMD1                     : 1;
    __IO uint8_t CMPEN                      : 1;
} stc_adc_adcmpctl_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 6;
    __IO uint16_t CD                        :10;
} stc_adc_adcmpd_field_t;

typedef struct
{
    __IO uint32_t STCH0                     : 1;
    __IO uint32_t STCH1                     : 1;
    __IO uint32_t STCH2                     : 1;
    __IO uint32_t STCH3                     : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t STCH8                     : 1;
    __IO uint32_t STCH9                     : 1;
    __IO uint32_t STCH10                    : 1;
    __IO uint32_t STCH11                    : 1;
    __IO uint32_t STCH12                    : 1;
    __IO uint32_t STCH13                    : 1;
    __IO uint32_t STCH14                    : 1;
    __IO uint32_t STCH15                    : 1;
} stc_adc_stsel_field_t;

typedef struct
{
    __IO uint8_t TM0                        : 2;
} stc_adc_sts0_field_t;

typedef struct
{
    __IO uint8_t TM1                        : 2;
} stc_adc_sts1_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 7;
} stc_adc_adcdiv_field_t;

typedef struct
{
    __IO uint8_t STRGIN                     : 4;
} stc_adc_adcstsl_field_t;

typedef struct
{
    __IO uint8_t PTRGIN                     : 4;
} stc_adc_adcptsl_field_t;

typedef struct
{
    __IO uint16_t AD_EN                     : 1;
    __IO uint16_t ENRDY                     : 1;
    uint16_t RESERVED2                      : 6;
    __IO uint16_t ENTM                      : 8;
} stc_adc_aden_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t RCMPEN                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RCMPTRG                   : 1;
    __IO uint16_t RCMPCNT                   : 3;
    uint16_t RESERVED8                      : 5;
    __IO uint16_t RCMPCN_ST                 : 3;
} stc_adc_adrcmpctl_field_t;

typedef struct
{
    __IO uint8_t RCMPCH                     : 5;
    __IO uint8_t RCMPMD                     : 1;
} stc_adc_adrcmps_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 6;
    __IO uint16_t CDL                       :10;
} stc_adc_adrcmpl_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 6;
    __IO uint16_t CDH                       :10;
} stc_adc_adrcmph_field_t;

typedef struct
{
    __IO uint32_t RCMPF                     : 1;
} stc_adc_adrcmpf_field_t;

typedef struct
{
    __IO uint8_t HC_EN                      : 1;
    __IO uint8_t MAIN_EN                    : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t SUB_EN                     : 1;
    __IO uint8_t PLL_EN                     : 1;
    __IO uint8_t INPUT                      : 3;
} stc_clock_ctrl_field_t;

typedef struct
{
    __IO uint8_t HC_RDY                     : 1;
    __IO uint8_t MAIN_RDY                   : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t SUB_RDY                    : 1;
    __IO uint8_t PLL_RDY                    : 1;
    __IO uint8_t SRC                        : 3;
} stc_clock_clk_stb_field_t;

typedef struct
{
    __IO uint32_t STBM                      : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t SPLV                      : 1;
    uint32_t RESERVED5                      :11;
    __IO uint32_t KEY                       :16;
} stc_clock_lpm_ctl_field_t;

typedef struct
{
    __IO uint16_t PWR                       : 1;
    __IO uint16_t RSTB                      : 1;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t LVD                       : 1;
    __IO uint16_t SWWDG                     : 1;
    __IO uint16_t HWWDG                     : 1;
    __IO uint16_t CF                        : 1;
    __IO uint16_t AF                        : 1;
    __IO uint16_t SW                        : 1;
} stc_clock_stat_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 3;
} stc_clock_bc_div_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 2;
} stc_clock_apb0_ctrl_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t RST                        : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t EN                         : 1;
} stc_clock_apb1_ctrl_field_t;

typedef struct
{
    __IO uint8_t DIV                        : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t SWCKE                      : 1;
    __IO uint8_t HWCKE                      : 1;
    __IO uint8_t DTCKE                      : 1;
} stc_clock_swdg_ctrl_field_t;

typedef struct
{
    __IO uint8_t MAINWT                     : 4;
    __IO uint8_t SUBWT                      : 4;
} stc_clock_cswt_field_t;

typedef struct
{
    __IO uint8_t PLLWT                      : 2;
} stc_clock_pswt_field_t;

typedef struct
{
    __IO uint8_t PLLFO                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PLLFR                      : 2;
} stc_clock_pll_ctl1_field_t;

typedef struct
{
    __IO uint8_t PLLN                       : 4;
    __IO uint8_t PRS                        : 1;
} stc_clock_pll_ctl2_field_t;

typedef struct
{
    __IO uint16_t MFCME                     : 1;
    __IO uint16_t SFCME                     : 1;
    __IO uint16_t MFCMRE                    : 1;
    __IO uint16_t SFCMRE                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t AFDE                      : 1;
    __IO uint16_t AFDRE                     : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t AFDCC                     : 3;
} stc_clock_fcm_ctl_field_t;

typedef struct
{
    __IO uint8_t MCFDF                      : 1;
    __IO uint8_t SCFDF                      : 1;
} stc_clock_fcm_str_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 5;
    __IO uint8_t SWWDG_BRK                  : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t HWWDG_BRK                  : 1;
} stc_clock_dbwdt_ctrl_field_t;

typedef struct
{
    __IO uint8_t MAINEN                     : 1;
    __IO uint8_t SUBEN                      : 1;
    __IO uint8_t PLLEN                      : 1;
    uint8_t RESERVED3                       : 2;
    __IO uint8_t AFDEN                      : 1;
} stc_clock_int_ctrl_field_t;

typedef struct
{
    __IO uint8_t MAIN                       : 1;
    __IO uint8_t SUB                        : 1;
    __IO uint8_t PLL                        : 1;
    uint8_t RESERVED3                       : 2;
    __IO uint8_t AFD                        : 1;
} stc_clock_int_pend_field_t;

typedef struct
{
    __IO uint8_t MAIN                       : 1;
    __IO uint8_t SUB                        : 1;
    __IO uint8_t PLL                        : 1;
    uint8_t RESERVED3                       : 2;
    __IO uint8_t AFD                        : 1;
} stc_clock_int_clr_field_t;

typedef struct
{
    __IO uint8_t CNT                        : 6;
} stc_clock_counter_cntrd_field_t;

typedef struct
{
    __IO uint8_t RLC                        : 6;
} stc_clock_counter_cntrl_field_t;

typedef struct
{
    __IO uint8_t CNTIF                      : 1;
    __IO uint8_t CNTIE                      : 1;
    __IO uint8_t CCS                        : 2;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t CNTOP                      : 1;
    __IO uint8_t CNTEN                      : 1;
} stc_clock_counter_cntc_field_t;

typedef struct
{
    __IO uint16_t CKSEL                     : 2;
    uint16_t RESERVED2                      : 6;
    __IO uint16_t DIV                       : 3;
} stc_clock_counter_cnt_clk0_field_t;

typedef struct
{
    __IO uint8_t CKEN                       : 1;
    __IO uint8_t RCKEN                      : 1;
} stc_clock_counter_cnt_clk1_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t SEL01                     : 4;
    __IO uint16_t SEL23                     : 4;
} stc_ctiosel03_ctsel0123_field_t;

typedef struct
{
    __IO uint8_t SSSR0                      : 1;
    __IO uint8_t SSSR1                      : 1;
    __IO uint8_t SSSR2                      : 1;
    __IO uint8_t SSSR3                      : 1;
    __IO uint8_t SSSR4                      : 1;
    __IO uint8_t SSSR5                      : 1;
    __IO uint8_t SSSR6                      : 1;
    __IO uint8_t SSSR7                      : 1;
} stc_ctsssr_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t EDGS                      : 2;
    __IO uint16_t MASK                      : 1;
    __IO uint16_t RSTEN                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_ppg_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_ppg_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_ppg_tcr2_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t FUNC                      : 3;
    __IO uint16_t T32                       : 1;
    __IO uint16_t EDGS                      : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_pwc_tcr_field_t;

typedef struct
{
    __IO uint8_t OVIR                       : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t MCIR                       : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t OVIE                       : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t MCIE                       : 1;
    __IO uint8_t ERR                        : 1;
} stc_ct_pwc_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_pwc_tcr2_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t EDGS                      : 2;
    __IO uint16_t MASK                      : 1;
    __IO uint16_t RSTEN                     : 1;
    __IO uint16_t CLKS                      : 3;
} stc_ct_pwm_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    __IO uint8_t DTMIR                      : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    __IO uint8_t DTMIE                      : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_pwm_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
} stc_ct_pwm_tcr2_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t ENCNT                     : 1;
    __IO uint16_t MODS                      : 1;
    __IO uint16_t PLRT                      : 1;
    __IO uint16_t FUNC                      : 3;
    __IO uint16_t T32                       : 1;
    __IO uint16_t EDGS                      : 2;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t CLKS                      : 3;
} stc_ct_rt_tcr_field_t;

typedef struct
{
    __IO uint8_t UDFIR                      : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TRGIR                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t UDFIE                      : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t TRGIE                      : 1;
} stc_ct_rt_sta_field_t;

typedef struct
{
    __IO uint8_t CLKS3                      : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t GTIE                       : 1;
} stc_ct_rt_tcr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      :24;
    __IO uint32_t DH                        : 4;
    __IO uint32_t PR                        : 1;
    uint32_t RESERVED29                     : 1;
    __IO uint32_t DS                        : 1;
    __IO uint32_t DE                        : 1;
} stc_dmac_dmacr_field_t;

typedef struct
{
    __IO uint32_t TC                        :16;
    __IO uint32_t BC                        : 4;
    uint32_t RESERVED20                     : 3;
    __IO uint32_t IS                        : 6;
    __IO uint32_t ST                        : 1;
    __IO uint32_t PB                        : 1;
    __IO uint32_t EB                        : 1;
} stc_dmac_dmaca0_field_t;

typedef struct
{
    __IO uint32_t EM                        : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t SS                        : 3;
    __IO uint32_t CI                        : 1;
    __IO uint32_t EI                        : 1;
    __IO uint32_t RD                        : 1;
    __IO uint32_t RS                        : 1;
    __IO uint32_t RC                        : 1;
    __IO uint32_t FD                        : 1;
    __IO uint32_t FS                        : 1;
    __IO uint32_t TW                        : 2;
    __IO uint32_t MS                        : 2;
} stc_dmac_dmacb0_field_t;

typedef struct
{
    __IO uint32_t DMACSA                    :32;
} stc_dmac_dmacsa0_field_t;

typedef struct
{
    __IO uint32_t DMACDA                    :32;
} stc_dmac_dmacda0_field_t;

typedef struct
{
    __IO uint32_t TC                        :16;
    __IO uint32_t BC                        : 4;
    uint32_t RESERVED20                     : 3;
    __IO uint32_t IS                        : 6;
    __IO uint32_t ST                        : 1;
    __IO uint32_t PB                        : 1;
    __IO uint32_t EB                        : 1;
} stc_dmac_dmaca1_field_t;

