wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32F146FX.h
typedef struct
{
    __IO uint16_t VC_FILTER_EN              : 1;
    __IO uint16_t VC_RESPONSE               : 3;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t VCINT_EDGE                : 2;
    __IO uint16_t VCINT_HIGH                : 1;
    __IO uint16_t VC2PT                     : 1;
    __IO uint16_t VCIE                      : 1;
    __IO uint16_t VCIF                      : 1;
    __IO uint16_t VC_HYS_SEL                : 1;
} stc_vc_ctl2_field_t;

typedef struct
{
    __IO uint8_t VC_TM0G                    : 1;
    __IO uint8_t VC_TM2G                    : 1;
} stc_vc_ctl3_field_t;

typedef struct
{
    __IO uint32_t LVD1_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD1_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD1_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD1_EN                   : 1;
} stc_wsunit_lvd1_set_field_t;

typedef struct
{
    __IO uint32_t LVD1_IF                   : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_IF                   : 1;
} stc_wsunit_lvd_int_str_field_t;

typedef struct
{
    __IO uint32_t LVD1_CLR                  : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t LVD2_CLR                  : 1;
} stc_wsunit_lvd_clr_field_t;

typedef struct
{
    __IO uint32_t LVD2_SVHR                 : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t LVD2_SVHD                 : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t LVD2_SRST                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t LVD2_EN                   : 1;
} stc_wsunit_lvd2_set_field_t;

typedef struct
{
    __IO uint8_t BUR01                      : 8;
} stc_wsunit_bur01_field_t;

typedef struct
{
    __IO uint8_t BUR02                      : 8;
} stc_wsunit_bur02_field_t;

typedef struct
{
    __IO uint8_t BUR03                      : 8;
} stc_wsunit_bur03_field_t;

typedef struct
{
    __IO uint8_t BUR04                      : 8;
} stc_wsunit_bur04_field_t;

typedef struct
{
    __IO uint8_t BUR05                      : 8;
} stc_wsunit_bur05_field_t;

typedef struct
{
    __IO uint8_t BUR06                      : 8;
} stc_wsunit_bur06_field_t;

typedef struct
{
    __IO uint8_t BUR07                      : 8;
} stc_wsunit_bur07_field_t;

typedef struct
{
    __IO uint8_t BUR08                      : 8;
} stc_wsunit_bur08_field_t;

typedef struct
{
    __IO uint8_t BUR09                      : 8;
} stc_wsunit_bur09_field_t;

typedef struct
{
    __IO uint8_t BUR10                      : 8;
} stc_wsunit_bur10_field_t;

typedef struct
{
    __IO uint8_t BUR11                      : 8;
} stc_wsunit_bur11_field_t;

typedef struct
{
    __IO uint8_t BUR12                      : 8;
} stc_wsunit_bur12_field_t;

typedef struct
{
    __IO uint8_t BUR13                      : 8;
} stc_wsunit_bur13_field_t;

typedef struct
{
    __IO uint8_t BUR14                      : 8;
} stc_wsunit_bur14_field_t;

typedef struct
{
    __IO uint8_t BUR15                      : 8;
} stc_wsunit_bur15_field_t;

typedef struct
{
    __IO uint8_t BUR16                      : 8;
} stc_wsunit_bur16_field_t;


typedef struct
{
    union
    {
        __IO uint16_t ADCTL;
        stc_adc_adctl_field_t ADCTL_f;
    };
    union
    {
        __IO uint16_t ADCINT;
        stc_adc_adcint_field_t ADCINT_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint8_t ADCSCTL;
        stc_adc_adcsctl_field_t ADCSCTL_f;
    };
    union
    {
        __IO uint8_t SFS;
        stc_adc_sfs_field_t SFS_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint32_t SFD;
        stc_adc_sfd_field_t SFD_f;
    };
    union
    {
        __IO uint32_t ADSIN0;
        stc_adc_adsin0_field_t ADSIN0_f;
        __IO uint32_t ADSIN1;
        stc_adc_adsin1_field_t ADSIN1_f;
    };
    uint8_t RESERVED7[4];
    union
    {
        __IO uint8_t ADCPCTL;
        stc_adc_adcpctl_field_t ADCPCTL_f;
    };
    union
    {
        __IO uint8_t PFS;
        stc_adc_pfs_field_t PFS_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint32_t PFD;
        stc_adc_pfd_field_t PFD_f;
    };
    union
    {
        __IO uint16_t ADPIN;
        stc_adc_adpin_field_t ADPIN_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint8_t ADCMPCTL;
        stc_adc_adcmpctl_field_t ADCMPCTL_f;
    };
    uint8_t RESERVED12[1];
    union
    {
        __IO uint16_t ADCMPD;
        stc_adc_adcmpd_field_t ADCMPD_f;
    };
    union
    {
        __IO uint32_t STSEL;
        stc_adc_stsel_field_t STSEL_f;
    };
    uint8_t RESERVED14[4];
    union
    {
        __IO uint8_t STS0;
        stc_adc_sts0_field_t STS0_f;
    };
    union
    {
        __IO uint8_t STS1;
        stc_adc_sts1_field_t STS1_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint8_t ADCDIV;
        stc_adc_adcdiv_field_t ADCDIV_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t ADCSTSL;
        stc_adc_adcstsl_field_t ADCSTSL_f;
    };
    union
    {
        __IO uint8_t ADCPTSL;
        stc_adc_adcptsl_field_t ADCPTSL_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t ADEN;
        stc_adc_aden_field_t ADEN_f;
    };
    uint8_t RESERVED20[10];
    union
    {
        __IO uint16_t ADRCMPCTL;
        stc_adc_adrcmpctl_field_t ADRCMPCTL_f;
    };
    uint8_t RESERVED21[2];
    union
    {
        __IO uint8_t ADRCMPS;
        stc_adc_adrcmps_field_t ADRCMPS_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint16_t ADRCMPL;
        stc_adc_adrcmpl_field_t ADRCMPL_f;
    };
    union
    {
        __IO uint16_t ADRCMPH;
        stc_adc_adrcmph_field_t ADRCMPH_f;
    };
    union
    {
        __IO uint32_t ADRCMPF;
        stc_adc_adrcmpf_field_t ADRCMPF_f;
    };
}M0P_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CTRL;
        stc_clock_ctrl_field_t CTRL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t CLK_STB;
        stc_clock_clk_stb_field_t CLK_STB_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint32_t LPM_CTL;
        stc_clock_lpm_ctl_field_t LPM_CTL_f;
    };
    union
    {
        __IO uint16_t STAT;
        stc_clock_stat_field_t STAT_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t BC_DIV;
        stc_clock_bc_div_field_t BC_DIV_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t APB0_CTRL;
        stc_clock_apb0_ctrl_field_t APB0_CTRL_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t APB1_CTRL;
        stc_clock_apb1_ctrl_field_t APB1_CTRL_f;
    };
    uint8_t RESERVED7[7];
    union
    {
        __IO uint8_t SWDG_CTRL;
        stc_clock_swdg_ctrl_field_t SWDG_CTRL_f;
    };
    uint8_t RESERVED8[15];
    union
    {
        __IO uint8_t CSWT;
        stc_clock_cswt_field_t CSWT_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t PSWT;
        stc_clock_pswt_field_t PSWT_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t PLL_CTL1;
        stc_clock_pll_ctl1_field_t PLL_CTL1_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t PLL_CTL2;
        stc_clock_pll_ctl2_field_t PLL_CTL2_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint16_t FCM_CTL;
        stc_clock_fcm_ctl_field_t FCM_CTL_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint8_t FCM_STR;
        stc_clock_fcm_str_field_t FCM_STR_f;
    };
    uint8_t RESERVED14[3];
    __IO uint16_t AFDWH;
    uint8_t RESERVED15[2];
    __IO uint16_t AFDWL;
    uint8_t RESERVED16[2];
    __IO uint16_t AFDC;
    uint8_t RESERVED17[2];
    union
    {
        __IO uint8_t DBWDT_CTRL;
        stc_clock_dbwdt_ctrl_field_t DBWDT_CTRL_f;
    };
    uint8_t RESERVED18[11];
    union
    {
        __IO uint8_t INT_CTRL;
        stc_clock_int_ctrl_field_t INT_CTRL_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t INT_PEND;
        stc_clock_int_pend_field_t INT_PEND_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint8_t INT_CLR;
        stc_clock_int_clr_field_t INT_CLR_f;
    };
}M0P_CLOCK_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CNTRD;
        stc_clock_counter_cntrd_field_t CNTRD_f;
    };
    union
    {
        __IO uint8_t CNTRL;
        stc_clock_counter_cntrl_field_t CNTRL_f;
    };
    union
    {
        __IO uint8_t CNTC;
        stc_clock_counter_cntc_field_t CNTC_f;
    };
    uint8_t RESERVED3[13];
    union
    {
        __IO uint16_t CNT_CLK0;
        stc_clock_counter_cnt_clk0_field_t CNT_CLK0_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t CNT_CLK1;
        stc_clock_counter_cnt_clk1_field_t CNT_CLK1_f;
    };
}M0P_CLOCK_COUNTER_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTSEL0123;
        stc_ctiosel03_ctsel0123_field_t CTSEL0123_f;
    };
}M0P_CTIOSEL03_TypeDef;

typedef struct
{
    uint8_t RESERVED0[252];
    union
    {
        __IO uint8_t CTSSSR;
        stc_ctsssr_field_t CTSSSR_f;
    };
}M0P_CTSSSR_TypeDef;

typedef struct
{
    __IO uint16_t LWRR;
    uint8_t RESERVED1[2];
    __IO uint16_t HWRR;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_ppg_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_ppg_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_ppg_tcr2_field_t TCR2_f;
    };
}M0P_CT_PPG_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    __IO uint16_t DBUF;
    uint8_t RESERVED1[6];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwc_tcr_field_t TCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwc_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwc_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWC_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[2];
    __IO uint16_t DUT;
    uint8_t RESERVED2[2];
    __IO uint16_t TCNT;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_pwm_tcr_field_t TCR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_pwm_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_pwm_tcr2_field_t TCR2_f;
    };
}M0P_CT_PWM_TypeDef;

typedef struct
{
    __IO uint16_t CSR;
    uint8_t RESERVED1[6];
    __IO uint16_t TCNT;
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t TCR;
        stc_ct_rt_tcr_field_t TCR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint8_t STA;
        stc_ct_rt_sta_field_t STA_f;
    };
    union
    {
        __IO uint8_t TCR2;
        stc_ct_rt_tcr2_field_t TCR2_f;
    };
}M0P_CT_RT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t DMACR;
        stc_dmac_dmacr_field_t DMACR_f;
    };
    uint8_t RESERVED1[12];
    union
    {
        __IO uint32_t DMACA0;
        stc_dmac_dmaca0_field_t DMACA0_f;
    };
    union
    {
        __IO uint32_t DMACB0;
        stc_dmac_dmacb0_field_t DMACB0_f;
    };
    union
    {
        __IO uint32_t DMACSA0;
        stc_dmac_dmacsa0_field_t DMACSA0_f;
    };
    union
    {
        __IO uint32_t DMACDA0;
        stc_dmac_dmacda0_field_t DMACDA0_f;
    };
    union
    {
        __IO uint32_t DMACA1;
        stc_dmac_dmaca1_field_t DMACA1_f;
    };
    union
    {
        __IO uint32_t DMACB1;
        stc_dmac_dmacb1_field_t DMACB1_f;
    };
    union
    {
        __IO uint32_t DMACSA1;
        stc_dmac_dmacsa1_field_t DMACSA1_f;
    };
    union
    {
        __IO uint32_t DMACDA1;
        stc_dmac_dmacda1_field_t DMACDA1_f;
    };
}M0P_DMAC_TypeDef;

typedef struct
{
    __IO uint32_t TIMERLOAD;
    __IO uint32_t TIMERVALUE;
    union
    {
        __IO uint32_t TIMERCTRL;
        stc_dtim_timerctrl_field_t TIMERCTRL_f;
    };
    __IO uint32_t TIMERINTCLR;
    union
    {
        __IO uint32_t TIMERRIS;
        stc_dtim_timerris_field_t TIMERRIS_f;
    };
    union
    {
        __IO uint32_t TIMERMIS;
        stc_dtim_timermis_field_t TIMERMIS_f;
    };
    __IO uint32_t TIMERBGLOAD;
}M0P_DTIM_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t INTEN;
        stc_extint_inten_field_t INTEN_f;
    };
    union
    {
        __IO uint32_t INTSRC;
        stc_extint_intsrc_field_t INTSRC_f;
    };
    union
    {
        __IO uint32_t INTCLR;
        stc_extint_intclr_field_t INTCLR_f;
    };
    union
    {
        __IO uint32_t INTLVL;
        stc_extint_intlvl_field_t INTLVL_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint16_t NMISRC;
        stc_extint_nmisrc_field_t NMISRC_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t NMICLR;
        stc_extint_nmiclr_field_t NMICLR_f;
    };
}M0P_EXTINT_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t FGET0;
        stc_fastio_fget0_field_t FGET0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FGET1;
        stc_fastio_fget1_field_t FGET1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t FGET2;
        stc_fastio_fget2_field_t FGET2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FGET3;
        stc_fastio_fget3_field_t FGET3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FGET4;
        stc_fastio_fget4_field_t FGET4_f;
    };
    uint8_t RESERVED5[7];
    union
    {
        __IO uint8_t FGET6;
        stc_fastio_fget6_field_t FGET6_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FGET7;
        stc_fastio_fget7_field_t FGET7_f;
    };
    uint8_t RESERVED7[35];
    union
    {
        __IO uint8_t FSET0;
        stc_fastio_fset0_field_t FSET0_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t FSET1;
        stc_fastio_fset1_field_t FSET1_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t FSET2;
        stc_fastio_fset2_field_t FSET2_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t FSET3;
        stc_fastio_fset3_field_t FSET3_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t FSET4;
        stc_fastio_fset4_field_t FSET4_f;
    };
    uint8_t RESERVED12[7];
    union
    {
        __IO uint8_t FSET6;
        stc_fastio_fset6_field_t FSET6_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t FSET7;
        stc_fastio_fset7_field_t FSET7_f;
    };
}M0P_FASTIO_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t FOCR;
        stc_flash_if_focr_field_t FOCR_f;
    };
    __IO uint32_t FLCR0;
    __IO uint32_t FLCR1;
    union
    {
        __IO uint32_t FSTR;
        stc_flash_if_fstr_field_t FSTR_f;
    };
    union
    {
        __IO uint32_t FWCICR;
        stc_flash_if_fwcicr_field_t FWCICR_f;
    };
    union
    {
        __IO uint32_t FUDR0;
        stc_flash_if_fudr0_field_t FUDR0_f;
    };
    uint8_t RESERVED6[12];
    union
    {
        __IO uint16_t TNVS;
        stc_flash_if_tnvs_field_t TNVS_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t TPROG;
        stc_flash_if_tprog_field_t TPROG_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint16_t TPGS;
        stc_flash_if_tpgs_field_t TPGS_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t TRCVPGM;
        stc_flash_if_trcvpgm_field_t TRCVPGM_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t TRCVPERS;
        stc_flash_if_trcvpers_field_t TRCVPERS_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t TRCVCERS;
        stc_flash_if_trcvcers_field_t TRCVCERS_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t TPERS;
        stc_flash_if_tpers_field_t TPERS_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t TCERS;
        stc_flash_if_tcers_field_t TCERS_f;
    };
}M0P_FLASH_IF_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t FN0;
        stc_gpio_fn0_field_t FN0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FN1;
        stc_gpio_fn1_field_t FN1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t FN2;
        stc_gpio_fn2_field_t FN2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FN3;
        stc_gpio_fn3_field_t FN3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FN4;
        stc_gpio_fn4_field_t FN4_f;
    };
    uint8_t RESERVED5[7];
    union
    {
        __IO uint8_t FN6;
        stc_gpio_fn6_field_t FN6_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FN7;
        stc_gpio_fn7_field_t FN7_f;
    };
    uint8_t RESERVED7[227];
    union
    {
        __IO uint8_t PU0;
        stc_gpio_pu0_field_t PU0_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t PU1;
        stc_gpio_pu1_field_t PU1_f;
    };
    uint8_t RESERVED9[7];
    union
    {
        __IO uint8_t PU3;
        stc_gpio_pu3_field_t PU3_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t PU4;
        stc_gpio_pu4_field_t PU4_f;
    };
    uint8_t RESERVED11[7];
    union
    {
        __IO uint8_t PU6;
        stc_gpio_pu6_field_t PU6_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t PU7;
        stc_gpio_pu7_field_t PU7_f;
    };
    uint8_t RESERVED13[227];
    union
    {
        __IO uint8_t DIR0;
        stc_gpio_dir0_field_t DIR0_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t DIR1;
        stc_gpio_dir1_field_t DIR1_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t DIR2;
        stc_gpio_dir2_field_t DIR2_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t DIR3;
        stc_gpio_dir3_field_t DIR3_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t DIR4;
        stc_gpio_dir4_field_t DIR4_f;
    };
    uint8_t RESERVED18[7];
    union
    {
        __IO uint8_t DIR6;
        stc_gpio_dir6_field_t DIR6_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t DIR7;
        stc_gpio_dir7_field_t DIR7_f;
    };
    uint8_t RESERVED20[227];
    union
    {
        __IO uint8_t GET0;
        stc_gpio_get0_field_t GET0_f;
    };
    uint8_t RESERVED21[3];
    union
    {
        __IO uint8_t GET1;
        stc_gpio_get1_field_t GET1_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint8_t GET2;
        stc_gpio_get2_field_t GET2_f;
    };
    uint8_t RESERVED23[3];
    union
    {
        __IO uint8_t GET3;
        stc_gpio_get3_field_t GET3_f;
    };
    uint8_t RESERVED24[3];
    union
    {
        __IO uint8_t GET4;
        stc_gpio_get4_field_t GET4_f;
    };
    uint8_t RESERVED25[7];
    union
    {
        __IO uint8_t GET6;
        stc_gpio_get6_field_t GET6_f;
    };
    uint8_t RESERVED26[3];
    union
    {
        __IO uint8_t GET7;
        stc_gpio_get7_field_t GET7_f;
    };
    uint8_t RESERVED27[227];
    union
    {
        __IO uint8_t SET0;
        stc_gpio_set0_field_t SET0_f;
    };
    uint8_t RESERVED28[3];
    union
    {
        __IO uint8_t SET1;
        stc_gpio_set1_field_t SET1_f;
    };
    uint8_t RESERVED29[3];
    union
    {
        __IO uint8_t SET2;
        stc_gpio_set2_field_t SET2_f;
    };
    uint8_t RESERVED30[3];
    union
    {
        __IO uint8_t SET3;
        stc_gpio_set3_field_t SET3_f;
    };
    uint8_t RESERVED31[3];
    union
    {
        __IO uint8_t SET4;
        stc_gpio_set4_field_t SET4_f;
    };
    uint8_t RESERVED32[7];
    union
    {
        __IO uint8_t SET6;
        stc_gpio_set6_field_t SET6_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t SET7;
        stc_gpio_set7_field_t SET7_f;
    };
    uint8_t RESERVED34[227];
    union
    {
        __IO uint32_t ANALOG;
        stc_gpio_analog_field_t ANALOG_f;
    };
    uint8_t RESERVED35[124];
    union
    {
        __IO uint8_t SPS;
        stc_gpio_sps_field_t SPS_f;
    };
    uint8_t RESERVED36[127];
    union
    {
        __IO uint32_t FN_SEL00;
        stc_gpio_fn_sel00_field_t FN_SEL00_f;
    };
    union
    {
        __IO uint32_t FN_SEL01;
        stc_gpio_fn_sel01_field_t FN_SEL01_f;
    };
    union
    {
        __IO uint32_t FN_SEL02;
        stc_gpio_fn_sel02_field_t FN_SEL02_f;
    };
    uint8_t RESERVED39[4];
    union
    {
        __IO uint32_t FN_SEL04;
        stc_gpio_fn_sel04_field_t FN_SEL04_f;
    };
    uint8_t RESERVED40[8];
    union
    {
        __IO uint32_t FN_SEL07;
        stc_gpio_fn_sel07_field_t FN_SEL07_f;
    };
    union
    {
        __IO uint32_t FN_SEL08;
        stc_gpio_fn_sel08_field_t FN_SEL08_f;
    };
    union
    {
        __IO uint32_t FN_SEL09;
        stc_gpio_fn_sel09_field_t FN_SEL09_f;
    };
    uint8_t RESERVED43[216];
    union
    {
        __IO uint8_t ODR0;
        stc_gpio_odr0_field_t ODR0_f;
    };
    uint8_t RESERVED44[3];
    union
    {
        __IO uint8_t ODR1;
        stc_gpio_odr1_field_t ODR1_f;
    };
    uint8_t RESERVED45[3];
    union
    {
        __IO uint8_t ODR2;
        stc_gpio_odr2_field_t ODR2_f;
    };
    uint8_t RESERVED46[3];
    union
    {
        __IO uint8_t ODR3;
        stc_gpio_odr3_field_t ODR3_f;
    };
    uint8_t RESERVED47[3];
    union
    {
        __IO uint8_t ODR4;
        stc_gpio_odr4_field_t ODR4_f;
    };
    uint8_t RESERVED48[7];
    union
    {
        __IO uint8_t ODR6;
        stc_gpio_odr6_field_t ODR6_f;
    };
    uint8_t RESERVED49[3];
    union
    {
        __IO uint8_t ODR7;
        stc_gpio_odr7_field_t ODR7_f;
    };
    uint8_t RESERVED50[483];
    union
    {
        __IO uint8_t FSETE0;
        stc_gpio_fsete0_field_t FSETE0_f;
    };
    uint8_t RESERVED51[3];
    union
    {
        __IO uint8_t FSETE1;
        stc_gpio_fsete1_field_t FSETE1_f;
    };
    uint8_t RESERVED52[3];
    union
    {
        __IO uint8_t FSETE2;
        stc_gpio_fsete2_field_t FSETE2_f;
    };
    uint8_t RESERVED53[3];
    union
    {
        __IO uint8_t FSETE3;
        stc_gpio_fsete3_field_t FSETE3_f;
    };
    uint8_t RESERVED54[3];
    union
    {
        __IO uint8_t FSETE4;
        stc_gpio_fsete4_field_t FSETE4_f;
    };
    uint8_t RESERVED55[7];
    union
    {
        __IO uint8_t FSETE6;
        stc_gpio_fsete6_field_t FSETE6_f;
    };
    uint8_t RESERVED56[3];
    union
    {
        __IO uint8_t FSETE7;
        stc_gpio_fsete7_field_t FSETE7_f;
    };
}M0P_GPIO_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_hwwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint8_t WDT_CLR;
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t WDT_STA;
        stc_hwwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[3];
    __IO uint32_t WDT_LCK;
}M0P_HWWDT_TypeDef;

